In [1]:
import pandas as pd
import numpy as np

In [3]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'])
print (days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [6]:
days_list = np.array(['Monday', 'Tuesday', 'Wednesday'])
numpy_days = pd.Series(days_list)
print(numpy_days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [8]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'], index = ['a', 'b', 'c'])

In [11]:
days1 = pd.Series({'a': 'Monday', 'b': 'Tuesday', 'c': 'Wednesday'})
print(days)
print(days1)

a       Monday
b      Tuesday
c    Wednesday
dtype: object
a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [13]:
days[0]

'Monday'

In [14]:
days[1:]

b      Tuesday
c    Wednesday
dtype: object

In [15]:
days['c']

'Wednesday'

In [17]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [19]:
df_dict = {'Country':['Ghana', 'kenya', 'Nigeria', 'Togo'], 
           'Capital':['Accra', 'Nairobi', 'Abuja', 'Lome'], 
           'Population': [10000, 8500, 35000, 12000], 
           'Age': [60, 70, 80, 75]}

In [31]:
df = pd.DataFrame(df_dict, index = [2, 4, 6, 8])

In [27]:
df_list = [['Ghana', 'Accra', 10000, 60], 
           ['Kenya', 'Nairobi', 8500, 70], 
           ['Nigeria', 'Abuja', 35000, 80], 
           ['Togo', 'Lome', 12000, 75]]

In [28]:
df1 = pd.DataFrame(df_list, columns = ['Country', 'Capital', 'Population', 'Age'],
                   index = [2, 4, 6, 8])

In [29]:
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [30]:
df1

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [33]:
df.iloc[3]

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

In [34]:
df.loc[6]

Country       Nigeria
Capital         Abuja
Population      35000
Age                80
Name: 6, dtype: object

In [35]:
df.iloc[1]

Country         kenya
Capital       Nairobi
Population       8500
Age                70
Name: 4, dtype: object

In [36]:
df.loc[4]

Country         kenya
Capital       Nairobi
Population       8500
Age                70
Name: 4, dtype: object

In [39]:
df['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [40]:
df['Age']

2    60
4    70
6    80
8    75
Name: Age, dtype: int64

In [42]:
df.at[6, 'Country']

'Nigeria'

In [44]:
df.at[6, 'Population']

35000

In [48]:
df.iat[3, 0]

'Togo'

In [49]:
df.iat[2, 0]

'Nigeria'

In [51]:
df['Population'].sum()

65500

In [53]:
df.mean()

C:\Users\HP\AppData\Local\Temp/ipykernel_12132/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Population    16375.00
Age              71.25
dtype: float64

In [54]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

In [55]:
df_dict2 = {'Names': ['JohnWick', 'Happiness', 'Funmi', 'np.nan'],
           'Profession': ['Killer', 'Photographer', 'Stylist', 'Politician'],
           'Experience': [12, np.nan, 10, 8],
           'Height': [np.nan, 175, 180, 150]}

In [68]:
new_df = pd.DataFrame(df_dict2)

In [69]:
new_df

       Names    Profession  Experience  Height
0   JohnWick        Killer        12.0     NaN
1  Happiness  Photographer         NaN   175.0
2      Funmi       Stylist        10.0   180.0
3     np.nan    Politician         8.0   150.0

In [70]:
new_df.isnull()

   Names  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3  False       False       False   False

In [72]:
new_df.dropna()

    Names  Profession  Experience  Height
2   Funmi     Stylist        10.0   180.0
3  np.nan  Politician         8.0   150.0